In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\Crude oil import cost in US dollars per barrel.csv")
df.head()

   Date  France  Germany  Italy  Spain    UK  Japan  Canada   USA
0  1998    12.4     12.5   12.2   11.8  12.6   13.7    13.2  12.0
1  1999    17.5     17.5   17.1   17.0  18.0   17.4    17.9  17.1
2  2000    28.2     28.1   27.8   27.2  28.5   28.7    29.1  27.5
3  2001    24.1     24.2   23.9   23.3  24.5   25.0    24.9  22.1
4  2002    24.6     24.4   24.3   24.0  24.6   25.0    25.0  23.5

In [3]:
df.tail()

      Date  France  Germany  Italy  Spain    UK  Japan  Canada   USA
40  18-Mar    66.4     65.8   65.6   63.2  67.2   66.3    65.7  55.3
41  18-Apr    71.0     69.7   69.0   67.6  71.6   67.2    69.2  58.5
42  18-May    75.5     75.3   74.5   71.5  77.5   72.3    75.0  64.4
43  18-Jun    74.8     74.5   73.5   70.9  75.5   77.2    74.5  65.5
44  18-Jul    74.4     74.3   74.5   71.8  75.3   76.9    72.0  65.9

In [4]:
df.dtypes

Date        object
France     float64
Germany    float64
Italy      float64
Spain      float64
UK         float64
Japan      float64
Canada     float64
USA        float64
dtype: object

In [5]:
df.isnull().sum()

Date       0
France     0
Germany    0
Italy      0
Spain      0
UK         0
Japan      0
Canada     0
USA        0
dtype: int64

In [6]:
df = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\Crude oil import cost in US dollars per barrel.csv", dtype= {'Date': 'str'})

In [7]:
df.dtypes

Date        object
France     float64
Germany    float64
Italy      float64
Spain      float64
UK         float64
Japan      float64
Canada     float64
USA        float64
dtype: object

In [8]:
data = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\world-population-by-country-2020.csv")
data.shape

(235, 12)

In [9]:
data.isnull().sum()

no                          0
Country (or dependency)     0
Population 2020             0
Yearly Change               0
Net Change                  0
Density  (P/Km²)            0
Land Area (Km²)             0
Migrants (net)             34
Fert. Rate                  0
Med. Age                    0
Urban Pop %                 0
World Share                 0
dtype: int64

In [11]:
data = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\world-population-by-country-2020.csv", na_values= {'Migrants (net)': 'not available', 'Yearly Change': 'NaN'})

In [12]:
data = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\world-population-by-country-2020.csv", keep_default_na=False)

In [13]:
data = pd.read_csv(r"D:\C_DRIVE_DOWNLOADS\world-population-by-country-2020.csv", na_filter=True)
data.shape

(235, 12)